wujique/stm32f407/board_dev/dev_lcd.c
	/* 读调色板 */
	if(NumColors != 0)
	{
		palatte = wjq_malloc(4*NumColors);
		f_read(&bmpfile, (void *)palatte, 4*NumColors, &rlen);
	}

	if(xlen > bi.biWidth)
        xlen = bi.biWidth;

    //如果长度比图片小，咋办? fix
    if(ylen > bi.biHeight)
        ylen = bi.biHeight;

	u8 *pdata;
	u8 linecnt = 20;//一次读多行，加快速度
	pdata = wjq_malloc(LineBytes*linecnt);

	
	dev_lcd_prepare_display(lcd, x, x+xlen-1, y, y+ylen-1);
			
    switch(bi.biBitCount)
    {
    case 1:
		u8 c;
		
        for(j=0; j<ylen; j++) //图片取模:横向,左高右低
        {
			f_read(&bmpfile, (void *)pdata, LineBytes, &rlen);
			
            for(i=0; i<xlen; i++)
            {
            	/*
            		一个字节8个像素，高位在前
            		调色板有256种颜色
				*/
                c = pdata[(i/8)]&(0x80>>(i%8));
                
                if(c != 0)
					*LcdData = WHITE;
                else
					*LcdData = BLACK;
            }
			
        }
        break;
        
    case 4:
        for(j=0; j<ylen; j++) //图片取模:横向,左高右低
        {
			f_read(&bmpfile, (void *)pdata, LineBytes, &rlen);
			if(rlen != LineBytes)
			{
				wjq_log(LOG_DEBUG, "bmp read data err!\r\n");
			}
			
            for(i=0; i<xlen; i++)
            {
            	/*4个bit 1个像素，要进行对U16的转换
					rgb565
					#define BLUE         	 0x001F  
					#define GREEN         	 0x07E0
					#define RED           	 0xF800
				*/
				k = *(pdata+i/2);
				if(i%2 == 0)
					k = ((k>>4)&0x0f);
				else
					k = (k&0x0f);
				k = k*4;
				
				r = (palatte[k+2] & 0xF8)>>3;
                g = (palatte[k+1] & 0xFC)>>2;
                b = (palatte[k] & 0xF8)>>3;
                color = (r<<11)|(g<<5)|(b<<0);
				
				*LcdData = color;
            }
			//Delay(1000);
        }
        break;

    case 8:
		for(j=0; j<ylen; j++) //图片取模:横向,左高右低
        {
			f_read(&bmpfile, (void *)pdata, LineBytes, &rlen);
			if(rlen != LineBytes)
			{
				wjq_log(LOG_DEBUG, "bmp read data err!\r\n");
			}
			
            for(i=0; i<xlen; i++)
            {
            	/*1个字节1个像素，要进行对U16的转换
					rgb565
					#define BLUE         	 0x001F  
					#define GREEN         	 0x07E0
					#define RED           	 0xF800
				*/
				k = *(pdata+i);
				k = k*4;
				
				r = (palatte[k+2] & 0xF8)>>3;
                g = (palatte[k+1] & 0xFC)>>2;
                b = (palatte[k] & 0xF8)>>3;
                color = (r<<11)|(g<<5)|(b<<0);
				
				*LcdData = color;
            }
			//Delay(1000);
        }
        break;

	case 16:

		break;
		
    case 24://65K真彩色		
        for(j=0; j<ylen;) //图片取模:横向,左高右低
        {

			res = f_read(&bmpfile, (void *)pdata, LineBytes*linecnt, &rlen);
			
			if(res != FR_OK)
			{
				wjq_log(LOG_DEBUG, "bmp read data err!\r\n");	
			}
			if(rlen != LineBytes*linecnt)
			{
				wjq_log(LOG_DEBUG, "bmp read data err!\r\n");
			}
			else
			{
				//wjq_log(LOG_DEBUG, "bmp read data:%d!\r\n", rlen);	
				//PrintFormat(tdata, 960);
			}
			
            for(i=0; i < xlen*linecnt; i++)
            {
            	/*3个字节1个像素，要进行对U16的转换
					rgb565
					#define BLUE         	 0x001F  
					#define GREEN         	 0x07E0
					#define RED           	 0xF800
				*/
				k = i*3;
				
				r = pdata[k+2];
				g = pdata[k+1];
				b = pdata[k];
				
				r = ((r<<8)&0xf800);
				g = ((g<<3)&0x07e0);
				b = ((b>>3)&0x001f);
				color = r+g+b;

				*LcdData = color;
            }
			//Delay(1000);
			j += linecnt;
        }
        break;

	case 32:
		break;
		
    default:
        break;
    } 

	wjq_free(pdata);
	if(NumColors != 0)
	{
		wjq_free(palatte);
	}
	
	f_close(&bmpfile);
    return 0;
}
#endif
/**
 *@brief:      dev_lcd_test
 *@details:    LCD测试函数
 *@param[in]   void  
 *@param[out]  无
 *@retval:     
 */
void dev_lcd_test(void)
{
	DevLcdNode *LcdCog = NULL;
	DevLcdNode *LcdOled = NULL;
	DevLcdNode *LcdOledI2C = NULL;
	DevLcdNode *LcdTft = NULL;

	/*  打开三个设备 */
	LcdCog = dev_lcd_open("spicoglcd");
	if(LcdCog==NULL)
		wjq_log(LOG_FUN, "open cog lcd err\r\n");

	LcdOled = dev_lcd_open("vspioledlcd");
	if(LcdOled==NULL)
		wjq_log(LOG_FUN, "open oled lcd err\r\n");
	
	LcdTft = dev_lcd_open("tftlcd");
	if(LcdTft==NULL)
		wjq_log(LOG_FUN, "open tft lcd err\r\n");

	LcdOledI2C = dev_lcd_open("i2coledlcd");
	if(LcdOledI2C==NULL)
		wjq_log(LOG_FUN, "open oled i2c lcd err\r\n");
	
	/*打开背光*/
	dev_lcd_backlight(LcdCog, 1);
	dev_lcd_backlight(LcdOled, 1);
	dev_lcd_backlight(LcdOledI2C, 1);
	dev_lcd_backlight(LcdTft, 1);

	#if 0/*不支持汉字时*/
	put_string(LcdCog, 5, 5, "spi cog lcd", BLACK);
	put_string(LcdOled, 5, 5, "vspi oled lcd", BLACK);
	put_string(LcdOledI2C, 5, 5, "i2c oled lcd", BLACK);
	put_string(LcdTft, 5, 5, "2.8 tft lcd", BLACK);
	#endif

	#if 1
	dev_lcd_put_string(LcdOled, FONT_SONGTI_1212, 10,1, "ABC-abc，", BLACK);
	dev_lcd_put_string(LcdOled, FONT_SIYUAN_1616, 1, 13, "这是oled lcd", BLACK);
	dev_lcd_put_string(LcdOled, FONT_SONGTI_1212, 10,30, "www.wujique.com", BLACK);
	dev_lcd_put_string(LcdOled, FONT_SIYUAN_1616, 1, 47, "屋脊雀工作室", BLACK);

	dev_lcd_put_string(LcdCog, FONT_SONGTI_1212, 10,1, "ABC-abc，", BLACK);
	dev_lcd_put_string(LcdCog, FONT_SIYUAN_1616, 1, 13, "这是cog lcd", BLACK);
	dev_lcd_put_string(LcdCog, FONT_SONGTI_1212, 10,30, "www.wujique.com", BLACK);
	dev_lcd_put_string(LcdCog, FONT_SIYUAN_1616, 1, 47, "屋脊雀工作室", BLACK);

	dev_lcd_put_string(LcdTft, FONT_SONGTI_1212, 20,30, "ABC-abc，", RED);
	dev_lcd_put_string(LcdTft, FONT_SIYUAN_1616, 20,60, "这是tft lcd", RED);
	dev_lcd_put_string(LcdTft, FONT_SONGTI_1212, 20,100, "www.wujique.com", RED);
	dev_lcd_put_string(LcdTft, FONT_SIYUAN_1616, 20,150, "屋脊雀工作室", RED);

	dev_lcd_put_string(LcdOledI2C, FONT_SONGTI_1212, 10,1, "ABC-abc，", BLACK);
	dev_lcd_put_string(LcdOledI2C, FONT_SIYUAN_1616, 1,13, "这是LcdOledI2C", BLACK);
	dev_lcd_put_string(LcdOledI2C, FONT_SONGTI_1212, 10,30, "www.wujique.com", BLACK);
	dev_lcd_put_string(LcdOledI2C, FONT_SIYUAN_1616, 1,47, "屋脊雀工作室", BLACK);
	#endif
	
	while(1);
}



void dev_i2coledlcd_test(void)
{

	DevLcdNode *LcdOledI2C = NULL;

	LcdOledI2C = dev_lcd_open("i2coledlcd");
	if(LcdOledI2C==NULL)
		wjq_log(LOG_FUN, "open oled i2c lcd err\r\n");
	
	/*打开背光*/
	dev_lcd_backlight(LcdOledI2C, 1);

	dev_lcd_put_string(LcdOledI2C, FONT_SONGTI_1212, 10,1, "ABC-abc，", BLACK);
	dev_lcd_put_string(LcdOledI2C, FONT_SIYUAN_1616, 1,13, "这是LcdOledI2C", BLACK);
	dev_lcd_put_string(LcdOledI2C, FONT_SONGTI_1212, 10,30, "www.wujique.com", BLACK);
	dev_lcd_put_string(LcdOledI2C, FONT_SIYUAN_1616, 1,47, "屋脊雀工作室", BLACK);


	LcdOledI2C = dev_lcd_open("i2coledlcd2");
	if(LcdOledI2C==NULL)
		wjq_log(LOG_FUN, "open oled i2c2 lcd err\r\n");
	
	/*打开背光*/
	dev_lcd_backlight(LcdOledI2C, 1);
	while(1)
	{
		dev_lcd_put_string(LcdOledI2C, FONT_SONGTI_1212, 10,1, "ABC-abc，", BLACK);
		dev_lcd_put_string(LcdOledI2C, FONT_SIYUAN_1616, 1,13, "这是LcdOledI2C", BLACK);
		dev_lcd_put_string(LcdOledI2C, FONT_SONGTI_1212, 10,30, "www.wujique.com", BLACK);
		dev_lcd_put_string(LcdOledI2C, FONT_SIYUAN_1616, 1,47, "屋脊雀工作室", BLACK);
		Delay(1000);
		dev_lcd_color_fill(LcdOledI2C, 1, 1000, 1, 1000, WHITE);
		Delay(1000);
	}

}

